Revit 2027 API
PlanViewRangeError Enumeration
 Describes errors in the location of planes in a PlanViewRange object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlanViewRangeError
Public Enumeration PlanViewRangeError
public enum class PlanViewRangeError
type PlanViewRangeError
Members
Member name | Value | Description
BottomClipAboveCutPlane | 1 |  Bottom clip plane is above the cut plane.
TopClipBelowCutPlane | 0 |  Top clip plane is below the cut plane.
ViewDepthAboveBottomClip | 2 |  View depth is above the bottom clip plane.
ViewDepthBelowTopClip | 3 |  View depth is below the top clip plane.
See Also
Reference
Autodesk.Revit.DB Namespace